// 1 Вам дана переменная str = 'максимально УЖАСНО'.
// Выведите в консоль слово максимально, только верхним регистром.
// let str = "максимально УЖАСНО"

//2 . Вам даны переменные str = 'Максимально', str2 = 'Ужасно'.
// Выведите в консоль соединенные строки
// 3. Вам дана переменная str = 'Максимально Ужасно'.
// Выведите в консоль индекс слова 'Ужасно'.
// 4. Вам дана переменная str = 'Максимально Ужасно'.

// Выведите в консоль "встречается более 1 раза",

// если букв 'a' встречается более 1 раза, иначе "встречается менее одного раза"
// 5. Вам дана переменная str = 'Максимально Ужасно'.
// Выведите в консоль индекс первого вхождения буквы а.


// 6. Вам дана переменная str = 'Максимально Ужасно'.
// Выведите в консоль индекс первого последнего буквы о.
// 7. Вам дана переменная str = 'aaa bbb ccc'.
// Вырежите из нее слово 'bbb'

// let str = "максимально УЖАСНО"
// console.log(str.split(" ")[0].toUpperCase());

// let str = "Максимально";
// let str2 = " Ужасно";
// console.log(str + str2);

// let str = 'Максимально Ужасно';
// console.log(str.split(" ")[1]);

// let str = 'Максимально Ужасно';
// let str2 = "н"
// if (str.indexOf(str2) === -1){
//     console.log("встречается менее одного раза");
// } else {
//     console.log("встречается более 1 раза");
// }

// let str = 'Максимально Ужасно';
// console.log(str.indexOf("а"));

// let str = 'Максимально Ужасно';
// console.log(str.indexOf("о"));
// console.log(str.lastIndexOf("о"));

// let str = "aaa bbb ccc";
// console.log(str.slice(4,7));
