// let a = 11
// if (a ===10){
//     console.log(true);
// }
// else{
//     console.log(false);
// }

// let a = 50;
// let b = 100;
// if (a > b) {
//     console.log("a больше b");
// }
// else {
//     console.log("a меньше b");
// }

// let a = 0;
// if (a > 0) {
//     console.log("positive");
// }
// else if (a === 0) {
//     console.log("равно");
// }
// else {
//     console.log("negative");
// }

// let number=45;
// if (number % 2 === 0) {
//     console.log("even");
// } else {
//     console.log("odd");
// }

// let a = 9;
// let b = 2;
// if (a % b === 0) {
//     console.log("even");
// }
// else {
//     console.log("odd");
// }

// let s = true;
// if (typeof s === "boolean"){
//  console.log("boolean");
// }
//  else if (typeof s === "number"){
// console.log("number");
// }
// else {
//  console.log("string");
// }

// let a = 10;
// if (a > 1 && a < 9) {
//     console.log("true");
// }
// else {
//     console.log("false");
// }

// let a = 3;
// if (a ===3 || a === 7) {
//     console.log(a + 7);
// } else {
//     console.log(a / 10);
// }

// let a =0;                                                                              
// let b =7;
// if (a <= 0 && b >= 5) {
//     console.log(a + b);
// } else {
//     console.log(a - b);
// }

// let a = 9;                                               
// let b = 7;
// if (a > 4 && a < 10 || b >= 7 && b < 17) {
//     console.log("true");
// } else {
//     console.log("false");
// }





// let month = 1;
// if (month >= 3 && month <= 5) {
//     console.log("весна");
// }
// else if (month >= 6 && month <= 8) {
//     console.log("лето");
// }
// else if (month >= 9 && month <= 11) {
//     console.log("осень");
// }
// else if (month === 1 || month === 2 || month === 12) {
//     console.log("зима");
// }
// else {
//     console.log("false");
// }

// let month = 5
// if (month >= 1 && month <= 12 && typeof month === "number") {
//     if (month >= 3 && month <= 5) {
//             console.log("весна");
//         }
//         else if (month >= 6 && month <= 8) {
//             console.log("лето");
//         }
//         else if (month >= 9 && month <= 11) {
//             console.log("осень");
//         }
//         else {
//             console.log("зима");
//         }
// } else {
//     console.log("введите число от 1 до 12");
// }




// let day = 20;
// if (day >=1 && day <10) {
//     console.log("первая декада");
// }
// else if (day >=10 && day < 20){
//     console.log("вторая декада");
// }
// else if (day >=20 && day < 31){
//     console.log("третья декада");
// }
// else {
//     console.log("false");
// }


// let str="12345";                                          
// if (str[0]==="1" || str[0]==="2" || str[0]==="3") {
//     console.log("Да");
// }
// else {
//     console.log("Нет");
// }


// let num = 6
// 1 toString()
// 2 String(6)
// 3 num + ""
// console.log(num.toString());
// console.log(String(num));
// console.log(num + "");


// let str = "6"
// 1 number
// 2 +
// 3 parseInt
// console.log(Number(str));
// console.log(+str);
// console.log(parseInt(str));

// let str = "helloukuku";
// console.log(str[4]);
// console.log(str[str.length-1]);





// let age = -15;                                                
// if (age >= 1 && age <5){
//     console.log("Года");
// } else if (age >=21 && age <=24) {
//     console.log("Года");
// } else if (age >=5 && age <=20) {
//     console.log("Лет");
// } else if (age >=25) {
//     console.log("Лет");
// } else {
//     console.log("false");
// }


// let time = 61;
// if (time >= 1 && time < 15) {
//   console.log("первая четверть");
// } else if (time >= 15 && time < 30) {
//   console.log("вторая четверть");
// } else if (time >= 30 && time < 45) {
//   console.log("третья четверть");
// } else if (time >= 45 && time < 60) {
//   console.log("четвертая четверть");
// } else {
//   console.log("false");
// }

// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.
// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".
// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной в консоль.
// 9. Вам даны переменные а , b. Если переменная a равна или меньше 0, а переменная b больше или равна 5, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти, или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.
// 14. Вам дана переменная age=*любое двузначное число*. Составьте условие, по которому, в консоль будет выводиться "Мне ** год", "Мне ** лет", в зависимости от возраста. Наример мне 21 год, мне 20 лет.
// 15. Вам дана переменная time= *любое чило от 1 до 59*. Составьте условие, по которому время будет делиться на четверти. Пример: time = 12 - Первая четверть. Если число больше 60, то в консоли будет выдаваться "Неверное число".